// npx — інструмент, призначений для того, щоб допомогти стандартизувати використання npm-пакетів.
// Постачається з npm версії 5.2.0 та вище.npm спрощує встановлення та керування залежностями, розміщеними в реєстрі,
// a npx спрощує використання CLI - утиліт та інших файлів, що виконуються, без необхідності їх встановлення в систему або проект.


// JSX(JavaScript Syntax Extension) - розширення синтаксису JavaScript, за допомогою якого зручно описувати розмітку того,
// що ми хочемо побачити на екрані. JSX створює елементи – найменші будівельні блоки React. Елементи Virtual DOM це звичайні JavaScript об'єкти,
// тому створювати їх дуже швидко.

// Ім'я компонента обов'язково повинно починатися з великої літери.Назви компонентів з маленької літери зарезервовані для HTML - елементів.
// Якщо ви спробуєте назвати компонент card, а не Card, під час рендеру React проігнорує його та відрендерить тег < card ></ >.

// ===================================================================================================================


// Хоча CSS - модуль виглядає як звичайний CSS, насправді він компілюється у формат, що називається ICSS(Interoperable CSS),
// який призначений для розробників інструментів на зразок Webpack, а не для кінцевих користувачів.

// До властивостей об'єкта зазвичай звертаються як css.alert, але можна використовувати квадратні дужки, наприклад css["alert"]. 
// Це корисно у випадку коли ім'я властивості зберігається у змінній, як у нас у пропсі variant.